nixkj/echoes/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240
CONFIG_FREERTOS_HZ=1000
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
# Enable OTA rollback protection
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_BOOTLOADER_APP_ANTI_ROLLBACK=n
# Task Watchdog Timer — initialise at boot so esp_task_wdt_add() is always
# available regardless of whether esp_task_wdt_reconfigure/init succeeds at
# runtime.  Timeout matches WDT_TIMEOUT_S in echoes.h (30 s).  trigger_panic
# ensures a clean reboot with a backtrace rather than a silent hang.
# idle_core_mask=0 — do not watch idle tasks; only subscribed tasks matter.
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=n
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n
# Interrupt Watchdog — catches global interrupt masking that would prevent
# the Task WDT from firing.  300 ms default.  Fires a level-4 (NMI)
# interrupt that cannot be masked — last line of defence before the RTC WDT.
CONFIG_ESP_INT_WDT=y
CONFIG_ESP_INT_WDT_TIMEOUT_MS=300
# Stack overflow detection — enables canary-based detection for all tasks.
# A corrupted stack could silently hang the scheduler without triggering
# any watchdog, because the TCB or WDT data structures are in heap adjacent
# to the stack.  This catches overflows before they cause silent corruption.
CONFIG_COMPILER_STACK_CHECK_MODE_STRONG=y
